; domain
(define (domain joint_termes-assistance1_domain)
(:requirements :typing :action-costs)

(:types
    numb position - object
)

(:constants
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (height ?p - position ?h -  numb)
    (prime-at ?p -  position)
    (free ?p -  position)
    (crone-has-block)
    (crone-not-has-block)
    (crone-has-prime)
    (crone-not-has-prime)
    (succ ?n1 - numb ?n2 -  numb)
    (not-is-depot ?p -  position)
    (has-block)
    (not-has-block)
    (neighbor ?p1 - position ?p2 -  position)
    (is-depot ?p -  position)
)

(:functions
    (total-cost) - number
)

(:action sup_put-down-block
    :parameters (?p - position ?hbefore - numb ?hafter - numb)
    :precondition (and
        (supporter_turn)
        (height ?p ?hbefore)
        (free ?p)
        (succ ?hafter ?hbefore)
        (crone-has-block)
        (not-is-depot ?p)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (height ?p ?hafter)
        (crone-not-has-block)
        (not (height ?p ?hbefore))
        (not (crone-has-block))
        (increase (total-cost) 1.0)
    )
)

(:action sup_pick-up-block
    :parameters (?p - position ?hbefore - numb ?hafter - numb)
    :precondition (and
        (supporter_turn)
        (height ?p ?hbefore)
        (free ?p)
        (succ ?hbefore ?hafter)
        (crone-not-has-block)
        (crone-not-has-prime)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (height ?p ?hafter)
        (crone-has-block)
        (not (height ?p ?hbefore))
        (not (crone-not-has-block))
        (increase (total-cost) 1.0)
    )
)

(:action sup_put-down-prime
    :parameters (?p - position ?hbefore - numb ?hafter - numb)
    :precondition (and
        (supporter_turn)
        (free ?p)
        (crone-has-prime)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (prime-at ?p)
        (crone-not-has-prime)
        (not (free ?p))
        (not (crone-has-prime))
        (increase (total-cost) 2.0)
    )
)

(:action sup_pick-up-prime
    :parameters (?p - position ?hbefore - numb ?hafter - numb)
    :precondition (and
        (supporter_turn)
        (prime-at ?p)
        (crone-not-has-block)
        (crone-not-has-prime)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (free ?p)
        (crone-has-prime)
        (not (prime-at ?p))
        (not (crone-not-has-prime))
        (increase (total-cost) 2.0)
    )
)

(:action pri_move
    :parameters (?from - position ?to - position ?h - numb)
    :precondition (and
        (prime_turn)
        (prime-at ?from)
        (neighbor ?from ?to)
        (free ?to)
        (height ?from ?h)
        (height ?to ?h)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (prime-at ?to)
        (free ?from)
        (not (prime-at ?from))
        (not (free ?to))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_move-up
    :parameters (?from - position ?hfrom - numb ?to - position ?hto - numb)
    :precondition (and
        (prime_turn)
        (prime-at ?from)
        (neighbor ?from ?to)
        (free ?to)
        (height ?from ?hfrom)
        (height ?to ?hto)
        (succ ?hto ?hfrom)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (prime-at ?to)
        (free ?from)
        (not (prime-at ?from))
        (not (free ?to))
        (increase (total-cost) 2000.0)
    )
)

(:action pri_move-down
    :parameters (?from - position ?hfrom - numb ?to - position ?hto - numb)
    :precondition (and
        (prime_turn)
        (prime-at ?from)
        (neighbor ?from ?to)
        (free ?to)
        (height ?from ?hfrom)
        (height ?to ?hto)
        (succ ?hfrom ?hto)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (prime-at ?to)
        (free ?from)
        (not (prime-at ?from))
        (not (free ?to))
        (increase (total-cost) 2000.0)
    )
)

(:action pri_place-block
    :parameters (?rpos - position ?bpos - position ?hbefore - numb ?hafter - numb)
    :precondition (and
        (prime_turn)
        (prime-at ?rpos)
        (neighbor ?rpos ?bpos)
        (height ?rpos ?hbefore)
        (height ?bpos ?hbefore)
        (succ ?hafter ?hbefore)
        (has-block)
        (not-is-depot ?bpos)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (height ?bpos ?hafter)
        (not-has-block)
        (not (height ?bpos ?hbefore))
        (not (has-block))
        (increase (total-cost) 3000.0)
    )
)

(:action pri_remove-block
    :parameters (?rpos - position ?bpos - position ?hbefore - numb ?hafter - numb)
    :precondition (and
        (prime_turn)
        (prime-at ?rpos)
        (neighbor ?rpos ?bpos)
        (height ?rpos ?hafter)
        (height ?bpos ?hbefore)
        (succ ?hbefore ?hafter)
        (not-has-block)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (height ?bpos ?hafter)
        (has-block)
        (not (height ?bpos ?hbefore))
        (not (not-has-block))
        (increase (total-cost) 3000.0)
    )
)

(:action pri_create-block
    :parameters (?p - position)
    :precondition (and
        (prime_turn)
        (prime-at ?p)
        (not-has-block)
        (is-depot ?p)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (has-block)
        (not (not-has-block))
        (increase (total-cost) 3000.0)
    )
)

(:action pri_destroy-block
    :parameters (?p - position)
    :precondition (and
        (prime_turn)
        (prime-at ?p)
        (has-block)
        (is-depot ?p)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (not-has-block)
        (not (has-block))
        (increase (total-cost) 2000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_termes-assistance1_problem_15)
(:domain joint_termes-assistance1_domain)
(:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 - position
    h0 h1 h2 h3 - numb
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (succ h3 h2)
    (succ h2 h1)
    (succ h1 h0)
    (not-is-depot pos0-0)
    (not-is-depot pos0-1)
    (not-is-depot pos0-2)
    (not-is-depot pos0-3)
    (not-is-depot pos0-4)
    (not-is-depot pos1-0)
    (not-is-depot pos1-1)
    (not-is-depot pos1-2)
    (not-is-depot pos1-4)
    (not-is-depot pos2-0)
    (not-is-depot pos2-1)
    (not-is-depot pos2-2)
    (not-is-depot pos2-3)
    (not-is-depot pos2-4)
    (prime-at pos2-2)
    (free pos0-0)
    (free pos0-1)
    (free pos0-2)
    (free pos0-3)
    (free pos0-4)
    (free pos1-0)
    (free pos1-1)
    (free pos1-2)
    (free pos1-3)
    (free pos1-4)
    (free pos2-0)
    (free pos2-1)
    (free pos2-3)
    (free pos2-4)
    (crone-not-has-block)
    (crone-not-has-prime)
    (height pos0-0 h0)
    (height pos0-1 h0)
    (height pos0-2 h0)
    (height pos0-3 h0)
    (height pos0-4 h0)
    (height pos1-0 h0)
    (height pos1-1 h0)
    (height pos1-2 h0)
    (height pos1-3 h0)
    (height pos1-4 h0)
    (height pos2-0 h0)
    (height pos2-1 h0)
    (height pos2-2 h0)
    (height pos2-3 h0)
    (height pos2-4 h0)
    (neighbor pos0-0 pos0-1)
    (neighbor pos0-1 pos0-0)
    (neighbor pos0-0 pos1-0)
    (neighbor pos1-0 pos0-0)
    (neighbor pos0-1 pos0-2)
    (neighbor pos0-2 pos0-1)
    (neighbor pos0-1 pos1-1)
    (neighbor pos1-1 pos0-1)
    (neighbor pos0-2 pos0-3)
    (neighbor pos0-3 pos0-2)
    (neighbor pos0-2 pos1-2)
    (neighbor pos1-2 pos0-2)
    (neighbor pos0-3 pos0-4)
    (neighbor pos0-4 pos0-3)
    (neighbor pos0-3 pos1-3)
    (neighbor pos1-3 pos0-3)
    (neighbor pos0-4 pos1-4)
    (neighbor pos1-4 pos0-4)
    (neighbor pos1-0 pos1-1)
    (neighbor pos1-1 pos1-0)
    (neighbor pos1-0 pos2-0)
    (neighbor pos2-0 pos1-0)
    (neighbor pos1-1 pos1-2)
    (neighbor pos1-2 pos1-1)
    (neighbor pos1-1 pos2-1)
    (neighbor pos2-1 pos1-1)
    (neighbor pos1-2 pos1-3)
    (neighbor pos1-3 pos1-2)
    (neighbor pos1-2 pos2-2)
    (neighbor pos2-2 pos1-2)
    (neighbor pos1-3 pos1-4)
    (neighbor pos1-4 pos1-3)
    (neighbor pos1-3 pos2-3)
    (neighbor pos2-3 pos1-3)
    (neighbor pos1-4 pos2-4)
    (neighbor pos2-4 pos1-4)
    (neighbor pos2-0 pos2-1)
    (neighbor pos2-1 pos2-0)
    (neighbor pos2-1 pos2-2)
    (neighbor pos2-2 pos2-1)
    (neighbor pos2-2 pos2-3)
    (neighbor pos2-3 pos2-2)
    (neighbor pos2-3 pos2-4)
    (neighbor pos2-4 pos2-3)
    (is-depot pos1-3)
    (not-has-block)
)

(:goal
  (and
    (height pos2-3 h3)
    (height pos0-0 h0)
    (height pos0-1 h0)
    (height pos0-2 h0)
    (height pos0-3 h0)
    (height pos0-4 h0)
    (height pos1-0 h0)
    (height pos1-1 h0)
    (height pos1-2 h0)
    (height pos1-3 h0)
    (height pos1-4 h0)
    (height pos2-0 h0)
    (height pos2-1 h0)
    (height pos2-2 h0)
    (height pos2-4 h0)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
2. (pri_move pos2-2 pos1-2 h0)
   deleted: (prime_turn) (prime-at pos2-2) (free pos1-2)
   added: (supporter_turn) (prime-at pos1-2) (free pos2-2)
   goals met: 14 of 15
3. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
4. (pri_move pos1-2 pos1-3 h0)
   deleted: (prime_turn) (prime-at pos1-2) (free pos1-3)
   added: (supporter_turn) (prime-at pos1-3) (free pos1-2)
   goals met: 14 of 15
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
6. (pri_create-block pos1-3)
   deleted: (prime_turn) (not-has-block)
   added: (supporter_turn) (has-block)
   goals met: 14 of 15
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
8. (pri_place-block pos1-3 pos2-3 h0 h1)
   deleted: (prime_turn) (height pos2-3 h0) (has-block)
   added: (supporter_turn) (height pos2-3 h1) (not-has-block)
   goals met: 14 of 15
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
10. (pri_create-block pos1-3)
   deleted: (prime_turn) (not-has-block)
   added: (supporter_turn) (has-block)
   goals met: 14 of 15
11. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
12. (pri_move pos1-3 pos1-2 h0)
   deleted: (prime_turn) (prime-at pos1-3) (free pos1-2)
   added: (supporter_turn) (prime-at pos1-2) (free pos1-3)
   goals met: 14 of 15
13. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
14. (pri_place-block pos1-2 pos2-2 h0 h1)
   deleted: (prime_turn) (height pos2-2 h0) (has-block)
   added: (supporter_turn) (height pos2-2 h1) (not-has-block)
   goals met: 13 of 15
15. (sup_pick-up-block pos2-2 h1 h0)
   deleted: (supporter_turn) (height pos2-2 h1) (crone-not-has-block)
   added: (prime_turn) (height pos2-2 h0) (crone-has-block)
   goals met: 14 of 15
16. (pri_move pos1-2 pos1-3 h0)
   deleted: (prime_turn) (prime-at pos1-2) (free pos1-3)
   added: (supporter_turn) (prime-at pos1-3) (free pos1-2)
   goals met: 14 of 15
17. (sup_put-down-block pos2-3 h1 h2)
   deleted: (supporter_turn) (height pos2-3 h1) (crone-has-block)
   added: (prime_turn) (height pos2-3 h2) (crone-not-has-block)
   goals met: 14 of 15
18. (pri_create-block pos1-3)
   deleted: (prime_turn) (not-has-block)
   added: (supporter_turn) (has-block)
   goals met: 14 of 15
19. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
20. (pri_move pos1-3 pos1-2 h0)
   deleted: (prime_turn) (prime-at pos1-3) (free pos1-2)
   added: (supporter_turn) (prime-at pos1-2) (free pos1-3)
   goals met: 14 of 15
21. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 14 of 15
22. (pri_place-block pos1-2 pos2-2 h0 h1)
   deleted: (prime_turn) (height pos2-2 h0) (has-block)
   added: (supporter_turn) (height pos2-2 h1) (not-has-block)
   goals met: 13 of 15
23. (sup_pick-up-block pos2-2 h1 h0)
   deleted: (supporter_turn) (height pos2-2 h1) (crone-not-has-block)
   added: (prime_turn) (height pos2-2 h0) (crone-has-block)
   goals met: 14 of 15
24. (pri_move pos1-2 pos1-3 h0)
   deleted: (prime_turn) (prime-at pos1-2) (free pos1-3)
   added: (supporter_turn) (prime-at pos1-3) (free pos1-2)
   goals met: 14 of 15
25. (sup_put-down-block pos2-3 h2 h3)
   deleted: (supporter_turn) (height pos2-3 h2) (crone-has-block)
   added: (prime_turn) (height pos2-3 h3) (crone-not-has-block)
   goals met: 15 of 15
